def get_value(inn):
#['', '', ''],

    org = {'2254002252': ['8968',   '3472492', 'КУРЬИНСКАЯ СРЕДНЯЯ ОБЩЕОБРАЗОВАТЕЛЬНАЯ ШКОЛА'],
           '2254003175': ['156603', '3412018', '"ДЕТСКО-ЮНОШЕСКАЯ СПОРТИВНАЯ ШКОЛА" КУРЬИНСКОГО РАЙОНА '],
           '2254003224': ['164566', '3456377', '"КУРЬИНСКИЙ КРАЕВЕДЧЕСКИЙ МУЗЕЙ" КУРЬИНСКОГО РАЙОНА'],
           '2254002816': ['164806', '3437139', '"КУРЬИНСКАЯ ДЕТСКАЯ ШКОЛА ИСКУССТВ"'],
           '2254003136': ['166004', '3415009', '"КУРЬИНСКАЯ МЕЖПОСЕЛЕНЧЕСКАЯ ЦЕНТРАЛЬНАЯ БИБЛИОТЕКА"'],
           '2254002622': ['188844', '1471518', 'ДЕТСКИЙ САД "ЗОРЕНЬКА" КУРЬИНСКОГО РАЙОНА'],
           '2254003658': ['188864', '1467835', 'ДЕТСКИЙ САД "БУРАТИНО" КУРЬИНСКОГО РАЙОНА'],
           '2254002654': ['193437', '1603377', '"МЕЖШКОЛЬНЫЙ УЧЕБНЫЙ КОМБИНАТ" КУРЬИНСКОГО РАЙОНА'],
           '2254002848': ['194462', '1467726', 'ДЕТСКИЙ САД "СПУТНИК" КУРЬИНСКОГО РАЙОНА'],
           '2254002661': ['194463', '1506793', '"ДОМ ДЕТСКОГО ТВОРЧЕСТВА" КУРЬИНСКОГО РАЙОНА'],
           '2254003489': ['288474', '3421264', '"КОЛЫВАНСКИЙ МУЗЕЙ ИСТОРИИ КАМНЕРЕЗНОГО ДЕЛА НА АЛТАЕ"'],
           '2254002862': ['194465', '1471165', 'ДЕТСКИЙ САД "СОЛНЫШКО" КУРЬИНСКОГО РАЙОНА'],
           '2254003506': ['198667', '1467658', 'ДЕТСКИЙ САД "МЕДВЕЖОНОК" КУРЬИНСКОГО РАЙОНА'],
           '2254003810': ['224229', '1603381', 'ОЗДОРОВИТЕЛЬНЫЙ СТАЦИОНАРНЫЙ ЛАГЕРЬ "ОЗЕРО БЕЛОЕ"'],
           '2254003295': ['271736', '3418783', '"КУРЬИНСКАЯ ЦЕНТРАЛИЗОВАННАЯ КЛУБНАЯ СИСТЕМА"'],
           '2254002693': ['43767', '1474884', '"УСТЬ-ТАЛОВСКАЯ СРЕДНЯЯ ОБЩЕОБРАЗОВАТЕЛЬНАЯ ШКОЛА"'],
           '2254002647': ['81302', '3564572', '"КАЗАНЦЕВСКАЯ СРЕДНЯЯ ОБЩЕОБРАЗОВАТЕЛЬНАЯ ШКОЛА"']

           }

    return org[inn]
